Revit 2024 API
Transaction.Commit Method
Overload List
Name | Description
Commit()
 Commits all changes made to the model during the transaction.
Commit(FailureHandlingOptions)
 Commits all changes made to the model during the transaction.
See Also
Transaction Class
Transaction Members
Autodesk.Revit.DB Namespace